const ABT = require("../function/ABT");

test("ABT", () => {
  expect(ABT(`lol`)).toBe(undefined);
  expect(ABT(37)).toBe(`สามสิบเจ็ดบาทถ้วน`);
  expect(ABT(`2000000000000.00`)).toBe(`สองล้านล้านบาทถ้วน`);
  expect(ABT(`123`)).toBe(`หนึ่งร้อยยี่สิบสามบาทถ้วน`);
  expect(ABT(`8.00`)).toBe(`แปดบาทถ้วน`);
  expect(ABT(`5678.00`)).toBe(`ห้าพันหกร้อยเจ็ดสิบแปดบาทถ้วน`);
  expect(ABT(`63147.89`)).toBe(
    `หกหมื่นสามพันหนึ่งร้อยสี่สิบเจ็ดบาทแปดสิบเก้าสตางค์`
  );
  expect(ABT(`51000001.00`)).toBe(`ห้าสิบเอ็ดล้านหนึ่งบาทถ้วน`);
  expect(ABT(`317.10`)).toBe(`สามร้อยสิบเจ็ดบาทสิบสตางค์`);
  expect(ABT(`422.26`)).toBe(`สี่ร้อยยี่สิบสองบาทยี่สิบหกสตางค์`);
  expect(ABT(`11.11`)).toBe(`สิบเอ็ดบาทสิบเอ็ดสตางค์`);
  expect(ABT(`191415.11`)).toBe(
    `หนึ่งแสนเก้าหมื่นหนึ่งพันสี่ร้อยสิบห้าบาทสิบเอ็ดสตางค์`
  );
  expect(ABT(`1.01`)).toBe(`หนึ่งบาทหนึ่งสตางค์`);
  expect(ABT(`5678.46`)).toBe(`ห้าพันหกร้อยเจ็ดสิบแปดบาทสี่สิบหกสตางค์`);
  expect(ABT(`0.67`)).toBe(`หกสิบเจ็ดสตางค์`);
  expect(ABT(`768,601,800,000,000`)).toBe(
    `เจ็ดร้อยหกสิบแปดล้านหกแสนหนึ่งพันแปดร้อยล้านบาทถ้วน`
  );
  expect(ABT([123])).toBe(undefined);
  expect(ABT(9007199254740992)).toBe(
    `เก้าพันเจ็ดล้านหนึ่งแสนเก้าหมื่นเก้าพันสองร้อยห้าสิบสี่ล้านเจ็ดแสนสี่หมื่นเก้าร้อยเก้าสิบสองบาทถ้วน`
  );
  expect(ABT(`-0.67`)).toBe(undefined);
});

test("ABT Negative", () => {
  expect(ABT(`-0.67`, false, true)).toBe(`ลบหกสิบเจ็ดสตางค์`);
  expect(ABT(`--0.67`, false, true)).toBe(undefined);
  expect(ABT(`-2000000000000.00`, false, true)).toBe(`ลบสองล้านล้านบาทถ้วน`);
  expect(ABT(`-123`, false, true)).toBe(`ลบหนึ่งร้อยยี่สิบสามบาทถ้วน`);
  expect(ABT(`-8.00`, false, true)).toBe(`ลบแปดบาทถ้วน`);
  expect(ABT(`-5678.00`, false, true)).toBe(`ลบห้าพันหกร้อยเจ็ดสิบแปดบาทถ้วน`);
  expect(ABT(`-63147.89`, false, true)).toBe(
    `ลบหกหมื่นสามพันหนึ่งร้อยสี่สิบเจ็ดบาทแปดสิบเก้าสตางค์`
  );
  expect(ABT(`-51000001.00`, false, true)).toBe(`ลบห้าสิบเอ็ดล้านหนึ่งบาทถ้วน`);
  expect(ABT(`-317.10`, false, true)).toBe(`ลบสามร้อยสิบเจ็ดบาทสิบสตางค์`);
  expect(ABT(`-422.26`, false, true)).toBe(
    `ลบสี่ร้อยยี่สิบสองบาทยี่สิบหกสตางค์`
  );
  expect(ABT(`-11.11`, false, true)).toBe(`ลบสิบเอ็ดบาทสิบเอ็ดสตางค์`);
  expect(ABT(`-191415.11`, false, true)).toBe(
    `ลบหนึ่งแสนเก้าหมื่นหนึ่งพันสี่ร้อยสิบห้าบาทสิบเอ็ดสตางค์`
  );
  expect(ABT(`-1.01`, false, true)).toBe(`ลบหนึ่งบาทหนึ่งสตางค์`);
  expect(ABT(`-๑.0๑`, false, true)).toBe(`ลบหนึ่งบาทหนึ่งสตางค์`);
  expect(ABT(`-5678.46`, false, true)).toBe(
    `ลบห้าพันหกร้อยเจ็ดสิบแปดบาทสี่สิบหกสตางค์`
  );
  expect(ABT(`-768,601,800,000,000`, false, true)).toBe(
    `ลบเจ็ดร้อยหกสิบแปดล้านหกแสนหนึ่งพันแปดร้อยล้านบาทถ้วน`
  );
});
