import BT from "../function/BT.mjs";
import op from "operation-strint";

test(`BT CEIL`, () => {
  expect(BT(`4.990001`, false, false, `c`)).toBe(`ห้าบาทถ้วน`);
});

test("BT OL", () => {
  expect(BT(`077`)).toBe(`เจ็ดสิบเจ็ดบาทถ้วน`);
  expect(BT(`077`, false, true)).toBe(`หกสิบสามบาทถ้วน`);
  expect(BT(`0o71`, false, true)).toBe(`ห้าสิบเจ็ดบาทถ้วน`);
  expect(BT(`0o71`)).toBe(undefined);
  expect(BT(`0o17`, false, true)).toBe(`สิบห้าบาทถ้วน`);
});

test("BT", () => {
  expect(BT(`lol`)).toBe(undefined);
  expect(BT(`2000000000000.9`, false, false, `c`)).toBe(
    `สองล้านล้านบาทเก้าสิบสตางค์`
  );
  expect(BT(`2000000000000.990003`, false, false, `c`)).toBe(
    `สองล้านล้านหนึ่งบาทถ้วน`
  );
  expect(BT(`2000000000000.99`, false, false, `f`)).toBe(
    `สองล้านล้านบาทเก้าสิบเก้าสตางค์`
  );
  expect(BT(`2000000000000.990003`, false, false, `f`)).toBe(
    `สองล้านล้านบาทเก้าสิบเก้าสตางค์`
  );
  expect(BT(`2000000000000.00`)).toBe(`สองล้านล้านบาทถ้วน`);
  expect(BT(`1000001000001`)).toBe(`หนึ่งล้านหนึ่งล้านหนึ่งบาทถ้วน`);
  expect(BT(`1000001000001`, true)).toBe(`หนึ่งล้านเอ็ดล้านเอ็ดบาทถ้วน`);
  expect(BT(`1000011000001`, true)).toBe(`หนึ่งล้านสิบเอ็ดล้านเอ็ดบาทถ้วน`);
  expect(BT(`101`)).toBe(`หนึ่งร้อยหนึ่งบาทถ้วน`);
  expect(BT(`101`, true)).toBe(`หนึ่งร้อยเอ็ดบาทถ้วน`);
  expect(BT(`123`)).toBe(`หนึ่งร้อยยี่สิบสามบาทถ้วน`);
  expect(BT(`8.00`)).toBe(`แปดบาทถ้วน`);
  expect(BT(`5678.00`)).toBe(`ห้าพันหกร้อยเจ็ดสิบแปดบาทถ้วน`);
  expect(BT(`63147.89`)).toBe(
    `หกหมื่นสามพันหนึ่งร้อยสี่สิบเจ็ดบาทแปดสิบเก้าสตางค์`
  );
  expect(BT(`51000001.00`, true)).toBe(`ห้าสิบเอ็ดล้านเอ็ดบาทถ้วน`);
  expect(BT(`51000001.00`)).toBe(`ห้าสิบเอ็ดล้านหนึ่งบาทถ้วน`);
  expect(BT(`317.10`)).toBe(`สามร้อยสิบเจ็ดบาทสิบสตางค์`);
  expect(BT(`422.26`)).toBe(`สี่ร้อยยี่สิบสองบาทยี่สิบหกสตางค์`);
  expect(BT(`11.11`)).toBe(`สิบเอ็ดบาทสิบเอ็ดสตางค์`);
  expect(BT(`191415.11`)).toBe(
    `หนึ่งแสนเก้าหมื่นหนึ่งพันสี่ร้อยสิบห้าบาทสิบเอ็ดสตางค์`
  );
  expect(BT(`1.01`)).toBe(`หนึ่งบาทหนึ่งสตางค์`);
  expect(BT(`5678.46`)).toBe(`ห้าพันหกร้อยเจ็ดสิบแปดบาทสี่สิบหกสตางค์`);
  expect(BT(`0.67`)).toBe(`หกสิบเจ็ดสตางค์`);
  expect(BT(`768,601,800,000,000`)).toBe(
    `เจ็ดร้อยหกสิบแปดล้านหกแสนหนึ่งพันแปดร้อยล้านบาทถ้วน`
  );
  expect(BT(`768_601_800_000_000`)).toBe(
    `เจ็ดร้อยหกสิบแปดล้านหกแสนหนึ่งพันแปดร้อยล้านบาทถ้วน`
  );
  expect(BT(`777777777777777777777777777777777777777777`)).toBe(
    `เจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดล้านเจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดล้านเจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดล้านเจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดล้านเจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดล้านเจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดล้านเจ็ดแสนเจ็ดหมื่นเจ็ดพันเจ็ดร้อยเจ็ดสิบเจ็ดบาทถ้วน`
  );
});

test(`sum bt`, () => {
  expect(BT(op.sum(`12`, `25`))).toBe(`สามสิบเจ็ดบาทถ้วน`);
  expect(BT(op.sum(`12`, `12`))).toBe(`ยี่สิบสี่บาทถ้วน`);
});
test(`minus bt`, () => {
  expect(BT(op.minus(`12`, `12`))).toBe(`ศูนย์บาทถ้วน`);
});