import f from "../function/SEP.mjs";

test(`sep`, () => {
  expect(f(`11`, `;;;`)).toBe(`สิบ;;;เอ็ด`);
  expect(f(`11`)).toBe(`สิบ-เอ็ด`);
  expect(f(`21`)).toBe(`ยี่-สิบ-เอ็ด`);
  expect(f(`101`)).toBe(`หนึ่ง-ร้อย-เอ็ด`);
  expect(f(`1001`)).toBe(`หนึ่ง-พัน-เอ็ด`);
  expect(f(`2501`)).toBe(`สอง-พัน-ห้า-ร้อย-เอ็ด`);
  expect(f(`501741221`)).toBe(
    `ห้า-ร้อย-เอ็ด-ล้าน-เจ็ด-แสน-สี่-หมื่น-หนึ่ง-พัน-สอง-ร้อย-ยี่-สิบ-เอ็ด`
  );
  // https://web.facebook.com/kumthai.th/posts/920804870082544
  expect(f(`2501.33`)).toBe(`สอง-พัน-ห้า-ร้อย-เอ็ด-บาท-สาม-สิบ-สาม-สตางค์`);
  expect(f(`1234.56`)).toBe(
    `หนึ่ง-พัน-สอง-ร้อย-สาม-สิบ-สี่-บาท-ห้า-สิบ-หก-สตางค์`
  );
});